{"Teaching":[{"position":"MSC1090 - Introduction to Computational Biostatistics with R","summary":"As a teaching assistant for this graduate-level course delivered through IMS, I assist Dr. Erik Spence in the delivery of this course and provide graduate students with a strong theoretical understanding of statistics and essential computational skills (Bash, R) needed to apply the theory to real world data."},{"position":"Krembil Centre for Neuroinformatics Summer Academy","summary":"I serve as a teaching assistant for the KCNI Summer Academy, an annual workshop held at the Centre for Addiction and Mental Health open to local and international researchers interested in getting hands-on experience with neuroinformatics. I developed and delivered workshops focused on SNP-level data integration using MetaXcan and PRSice-2."},{"position":"NeuroSci 101 - Neural Networks & Artificial Brains","summary":"I am s a guest lecturer for NeuroSci 101, a free course organized by the Collaborative Program in Neuroscience at UofT, offered to high school students interested in learning more about neuroscience. I developed and delivered interactive lecture material on Neural Networks & Artificial Brains."}],"Mentorship":[{"position":"GradMinds Peer Support Initiative","summary":"I was a founding member and executive member of the GMPS, a peer support initiative led by GradMinds, the Mental Health Committee of the UofT’s Graduate Student Union. The GMPS was focused on providing fellow graduate students a safe and judgment-free space to interact with other graduate students. I worked with other executive members to gather training opportunities for mentors affiliated with GMPS. As a mentor myself, I maintained 8 mentorship relationships over two years."},{"position":"Neurological and Neurodegenerative Disease Student Association","summary":"I am a mentor for NANSA, a student-run organization at UofT fostering student interest in research related to neurological diseases. I have mentored 3 undergraduate students through this organization."},{"position":"Collaborative Program in Neuroscience Undergraduate Mentorship Program","summary":"I am a mentor for the CPIN Undergraduate Mentorship Program which offers senior undergraduate students interested in graduate programs in neuroscience an opportunity to connect with current graduate students and learn about the application process and day to day work of graduate research. I have mentored 3 students through this program."}],"Elemental Magazine":[{"name":"Shkaabe Makwa, bringing First Nations, Inuit, and Métis Mental Health to the Forefront—an interview with Louis Busch.","publisher":"Issue 11. Hope & Resilience (2024)","url":"https://www.elementalmag.ca/#current-issue"},{"name":"Sleep, psychiatric diagnoses, and beyond—an interview with Dr. Michael Wainberg.","publisher":"Issue 9. Physical Health & Mental Health (2022) pp.30-31","url":"https://issuu.com/elementalmagazine/docs/elemental_issue_9_physical_health"},{"name":"The evolving understanding of substance use during the pandemic—an interview with Dr. Tara Elton-Marshall.","publisher":"Issue 7. COVID-19 (2021) pp.30-31","url":"https://issuu.com/elementalmagazine/docs/elemental_issue_7_-_covid-19"}]}